function solution(game_board, table) {
   const background = [...game_board];

}



let game_board = [[1,1,0,0,1,0],[0,0,1,0,1,0],[0,1,1,0,0,1],[1,1,0,1,1,1],[1,0,0,0,1,0],[0,1,1,1,0,0]];
let tbl =[[1,0,0,1,1,0],[1,0,1,0,1,0],[0,1,1,0,1,1],[0,0,1,0,0,0],[1,1,0,1,1,0],[0,1,0,0,0,0]];
// 빈칸이 0 채워진게 1
/*
[ [1,1,0,0,1,0]
  [0,0,1,0,1,0],
  [0,1,1,0,0,1],
  [1,1,0,1,1,1],
  [1,0,0,0,1,0],
  [0,1,1,1,0,0]
 ]
 */
// 1이 조각
/*
[1,0,0,1,1,0],
[1,0,1,0,1,0],
[0,1,1,0,1,1],
[0,0,1,0,0,0],
[1,1,0,1,1,0],
[0,1,0,0,0,0]
 */
// 행렬을 변환한다. p는 Piece의 인스턴스이다.
// for (let y = 0; y < p.shape.length; ++y) {
//     for (let x = 0; x < y; ++x) {
//         [p.shape[x][y], p.shape[y][x]] =
//             [p.shape[y][x], p.shape[x][y]];
//     }
// }
//
// // 열 순서대로 뒤집는다.
// p.shape.forEach(row => row.reverse());
console.log(solution(game_board, tbl));